# -- coding: utf-8 --
""" Напишите программу,которая считывает три числа и выводит их сумму.
Каждое число записано в отдельной строке."""

a = int(input("Введите число А="))
b = int(input("Введите число Б="))
c = int(input("Введите число С="))

print("Сумма = " +str(a+b+c))