# -- coding: utf-8 --
"""Напишите функцию, которая вычисляет наименьшее из трех чисел и выводит на экран."""

def func ():
    A = int(input('A= '))
    B = int(input('B= '))
    C = int(input('C= '))
    return min(A,B,C)
print ("Наименьшее число: " +str(func()))
