# -- coding: utf-8 --
"""Напишите функцию, которая вычисляет наименьшее из трех чисел и выводит на экран."""

A = int(input('A= '))
B = int(input('B= '))
C = int(input('C= '))

if A<B: E=A 
else: E=B 
if E>C: E=C
print ("Наименьшее число: " +str(E))